src/Catalogs/SalesTaxComponents.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>SalesTaxComponents</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Agency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SalesTaxAgencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Rate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/SalesTaxRates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>SalesTaxRates</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Agency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SalesTaxAgencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Rate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CombinedTaxRate</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesTaxComponent</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SalesTaxComponents</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/SalesTaxComponents/Ext/ObjectModule.bsl
Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		return;
	EndIf;
	Request = New Query("SELECT
	                    |	SalesTaxRates.Ref,
	                    |	SalesTaxRates.Parent
	                    |INTO TaxRatesAffected
	                    |FROM
	                    |	Catalog.SalesTaxRates AS SalesTaxRates
	                    |WHERE
	                    |	SalesTaxRates.SalesTaxComponent = &SalesTaxComponent
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |SELECT DISTINCT
	                    |	TaxRatesAffected.Ref
	                    |FROM
	                    |	TaxRatesAffected AS TaxRatesAffected
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |SELECT
	                    |	SalesTaxRates.Ref,
	                    |	SalesTaxRates.Parent,
	                    |	SalesTaxRates.Rate
	                    |FROM
	                    |	TaxRatesAffected AS TaxRatesAffected
	                    |		INNER JOIN Catalog.SalesTaxRates AS SalesTaxRates
	                    |		ON (TaxRatesAffected.Ref = SalesTaxRates.Ref
	                    |				OR (TaxRatesAffected.Parent = SalesTaxRates.Ref
	                    |					OR TaxRatesAffected.Parent = SalesTaxRates.Parent)
	                    |					AND TaxRatesAffected.Parent <> VALUE(Catalog.SalesTaxRates.EmptyRef))");
	Request.SetParameter("SalesTaxComponent", Ref);
	ResArray		= Request.ExecuteBatch();
	//Lock all sales tax rates affected
	RefsForLock		= ResArray[2].Unload();
	TaxRatesLock	= New DataLock();
	TaxRatesLockItem = TaxRatesLock.Add("Catalog.SalesTaxRates");
	TaxRatesLockItem.DataSource = RefsForLock;
	TaxRatesLockItem.UseFromDataSource("Ref", "Ref");
	TaxRatesLockItem.Mode = DataLockMode.Exclusive;
	TaxRatesLock.Lock();
	
	//First process sales tax rates components and after that recalculate total tax rate of combined sales tax rates items
	ComponentsToProcess 	= ResArray[1].Unload();
	
	For Each ComponentRate In ComponentsToProcess Do
		ComponentTaxRateObject 				= ComponentRate.Ref.GetObject();
		ComponentTaxRateObject.Description 	= Description;
		ComponentTaxRateObject.Agency 		= Agency;
		ComponentTaxRateObject.Rate			= Rate;
		ComponentTaxRateObject.Write();
	EndDo;
	
	//Execute query for the second time, after data locks are applied
	//to calculate total rates
		
	//Recalculating totals of the affected combined tax rates
	CombinedTaxRates = Request.Execute().Unload();
	CombinedTaxRates.GroupBy("Parent", "Rate");
	For Each CombinedTaxRate In CombinedTaxRates Do
		If CombinedTaxRate.Parent = Catalogs.SalesTaxRates.EmptyRef() Then
			Continue;
		EndIf;
		CombinedTaxRateObject = CombinedTaxRate.Parent.GetObject();
		CombinedTaxRateObject.Rate = CombinedTaxRate.Rate;
		CombinedTaxRateObject.Write();
	EndDo;	
EndProcedure
